{
  "url": "https://support.google.com/websearch/answer/86640",
  "domain": "generic",
  "content": "Title: Resolve Google Search’s \"Unusual traffic from your computer network\" message\n\nContent:\nResolve Google Search’s \"Unusual traffic from your computer network\" message\nIf a network you use, including VPN networks, seems to be sending automated traffic to Google Search, you might get the message “Our systems have detected unusual traffic from your computer network.”\nWhat to do when you get this message\nThe message most likely shows a reCAPTCHA. To confirm that you’re a person and not a robot, solve the reCAPTCHA. After you solve it, the message goes away, and you can use Google again.\nIf you don't get a reCAPTCHA, check if:\nYour browser is supported by reCAPTCHA\nJavaScript is enabled\nLearn how to solve a reCAPTCHA.\nWhat to do if you continue to get the message\nHere's what you can do if you continue to get the \"Unusual traffic from your computer network\" message:\nLearn how to detect and remove malware.\nYou or another user on your network might have malware, which is malicious software that can be installed on your computer without your knowledge. Some malware can cause Google to show this message.\nContact your network administrator or IT professional to help you locate the source and stop the problem.\nYou could get this message if others that use the same network you use, like at a school or business, are sending automated searches to Google.\nUninstall the VPN from your computer or network, or contact your VPN provider.\nYou could get this message if others that use the same Virtual Private Network (VPN) you use are sending automated searches to Google.\nThis can also happen with IPv6 tunnel services.\nSome VPNs and tunnel services cause all traffic to be blocked because they make it impossible for Google to tell the difference between abusive and non-abusive traffic.\nContact your internet provider about the error.\nYou could get this message if others that use the same internet provider you use are sending automated searches to Google.\nWhat to do if you’re a network administrator or provider\nIf you administer a network or are an internet service or VPN provider, locate the sources of automated traffic to Google and block them. Once the automated searches have stopped, your users should be able to search normally on Google.\nNetwork administrators or others should thoroughly review before they buy IP space from an IP broker. If possible, ask to test the network first to make sure it can access major websites and doesn’t have any existing blocks on it.\nWhat Google considers automated traffic\nSearches sent from these sources:\nRobots\nComputer programs\nAutomated services\nSearch scrapers\nUse of software that sends searches to Google to find how a website or web page ranks on Google\nGive feedback about this article\nWas this helpful?YesNo",
  "crawled_at": 1744979375.078579
}